src/InformationRegisters/МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресДоставкиВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийКомментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Самовывоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МегаЛогист_СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетУточнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеСоответствиеСтрокТовары</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеСоответствиеСтрокУслуги</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеЦветаРабочегоКомментария</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МегаЛогист_ИсторияСтатусовЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>МегаЛогист_ИсторияСтатусовЗаказовПокупателей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МегаЛогист_СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Представление</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоменноеИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефонаБезКодов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДляСписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МегаЛогист_ИсторияСтатусовМаршрутныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>МегаЛогист_ИсторияСтатусовМаршрутныхЗаданий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МегаЛогист_СтатусыМаршрутныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>МаршрутноеЗадание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МегаЛогист_МаршрутноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/МегаЛогист_СтатусыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>МегаЛогист_СтатусыЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержденный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполненный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмененный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/МегаЛогист_СтатусыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>МегаЛогист_СтатусыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/МегаЛогист_СтатусыОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>МегаЛогист_СтатусыОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОтгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/МегаЛогист_СтатусыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>МегаЛогист_СтатусыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/МегаЛогист_СтатусыМаршрутныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>МегаЛогист_СтатусыМаршрутныхЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КРаспределению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/МегаЛогист_УправлениеЗаказамиКлиентов/Ext/Module.bsl
Процедура ЗаказПокупателяПриЗаписи(Источник, Отказ) Экспорт

	мзДР = РегистрыСведений.МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.СоздатьМенеджерЗаписи();
	мзДР.Заказ = Источник.Ссылка;
	мзДР.Прочитать();
	Если Не ЗначениеЗаполнено(мзДР.Статус) Тогда
		мзДР.Заказ	= Источник.Ссылка;
		мзДР.Статус	= Перечисления.МегаЛогист_СтатусыЗаказа.Новый;
		Попытка
			мзДР.Записать(Истина);
		Исключение
			Отказ = Истина;
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСтатусЗаказаПокупателя(ЗаказПокупателяСсылка, Статус, Отказ = Ложь) Экспорт
	
	мзДР = РегистрыСведений.МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.СоздатьМенеджерЗаписи();
	мзДР.Заказ = ЗаказПокупателяСсылка;
	мзДР.Прочитать();
	мзДР.Заказ	= ЗаказПокупателяСсылка;
	мзДР.Статус	= Статус;
	Попытка
		мзДР.Записать(Истина);
	Исключение
		Отказ = Истина;
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
	КонецПопытки;
	
	мзДР = РегистрыСведений.МегаЛогист_ИсторияСтатусовЗаказовПокупателей.СоздатьМенеджерЗаписи();
	мзДР.Период				= ТекущаяДата();
	мзДР.ЗаказПокупателя	= ЗаказПокупателяСсылка;
	мзДР.Статус				= Статус;
	мзДР.Ответственный		= ПараметрыСеанса.ТекущийПользователь;
	Попытка
		мзДР.Записать(Истина);
	Исключение
		Отказ = Истина;
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьСтатусЗаказаПокупателя(Заказ) Экспорт
	
	Статус = Перечисления.МегаЛогист_СтатусыЗаказа.Новый;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.Заказ,
	               |	МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.Статус
	               |ИЗ
	               |	РегистрСведений.МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей КАК МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей
	               |ГДЕ
	               |	МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.Заказ = &Заказ";
	Запрос.УстановитьПараметр("Заказ",Заказ);			   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Статус = Выборка.Статус;
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

Функция ПолучитьДопРеквизитЗаказаПокупателя(Заказ, ИмяРеквизита) Экспорт
	
	Результат = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.Заказ,
	               |	МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей." + ИмяРеквизита + " КАК ЗначениеРеквизита
	               |ИЗ
	               |	РегистрСведений.МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей КАК МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей
	               |ГДЕ
	               |	МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.Заказ = &Заказ";
	Запрос.УстановитьПараметр("Заказ",Заказ);			   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ЗначениеРеквизита;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСокращенныйАдресДоставки(Заказ) Экспорт
	
	Результат = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.Заказ,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей КАК МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |		ПО МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.Заказ.Контрагент = КонтактнаяИнформация.Объект
	               |			И МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.АдресДоставкиВид = КонтактнаяИнформация.Вид
	               |			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	               |ГДЕ
	               |	МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.Заказ = &Заказ";
	Запрос.УстановитьПараметр("Заказ",Заказ);			   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Представление;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСписокВыбораВремени(СписокВыбора) Экспорт
	
	СписокВыбора.Очистить();
	Для а = 0 по 23 Цикл
		ВремяСписка = НачалоДня(ТекущаяДата()) + а*60*60;
		СписокВыбора.Добавить(ВремяСписка, Формат(ВремяСписка,"ДФ='ЧЧ:мм'"));
	КонецЦикла; 
	
КонецПроцедуры

Функция ПолучитьСтатусОплатыЗаказаПокупателя(ЗаказПокупателя) Экспорт

	СтатусОплаты = Перечисления.МегаЛогист_СтатусыОплаты.НеОплачен;
	Если Не ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат СтатусОплаты;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход, 0) = 0
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыОплаты.НеОплачен)
	               |		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаУпрРасход >= РасчетыСКонтрагентамиОстаткиИОбороты.СуммаУпрПриход
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыОплаты.Оплачен)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыОплаты.ЧастичноОплачен)
	               |	КОНЕЦ КАК СтатусОплаты
	               |ИЗ
	               |	РегистрНакопления.РасчетыСКонтрагентами.ОстаткиИОбороты(, , , , Сделка = &ЗаказПокупателя) КАК РасчетыСКонтрагентамиОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(, , , , Сделка = &ЗаказПокупателя) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	               |		ПО РасчетыСКонтрагентамиОстаткиИОбороты.Сделка = ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка";
	Запрос.УстановитьПараметр("ЗаказПокупателя" ,ЗаказПокупателя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтатусОплаты = Выборка.СтатусОплаты;
	КонецЕсли;
	
	Возврат СтатусОплаты;
	
КонецФункции

Функция ПолучитьСуммуОплатыЗаказаПокупателя(ЗаказПокупателя) Экспорт
	
	СуммаОплаты="";
	
	Если Не ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат 0;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход, 0) = 0
	               |			ТОГДА РасчетыСКонтрагентамиОстаткиИОбороты.СуммаУпрПриход
	               |		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаУпрРасход >= РасчетыСКонтрагентамиОстаткиИОбороты.СуммаУпрПриход
	               |			ТОГДА 0
	               |		ИНАЧЕ (РасчетыСКонтрагентамиОстаткиИОбороты.СуммаУпрПриход - ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаУпрРасход)  
	               |	КОНЕЦ КАК СуммаОплаты
	               |ИЗ
	               |	РегистрНакопления.РасчетыСКонтрагентами.ОстаткиИОбороты(, , , , Сделка = &ЗаказПокупателя) КАК РасчетыСКонтрагентамиОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(, , , , Сделка = &ЗаказПокупателя) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	               |		ПО РасчетыСКонтрагентамиОстаткиИОбороты.Сделка = ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка";
	Запрос.УстановитьПараметр("ЗаказПокупателя" ,ЗаказПокупателя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СуммаОплаты = Выборка.СуммаОплаты;
	КонецЕсли;
	
	Возврат СуммаОплаты;
	
КонецФункции

Функция ПолучитьСтатусОтгрузкиЗаказаПокупателя(ЗаказПокупателя) Экспорт

	СтатусОтгрузки = Перечисления.МегаЛогист_СтатусыОтгрузки;
	Если Не ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат СтатусОтгрузки;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказыПокупателейОстаткиИОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПокупателейОстаткиИОбороты.КоличествоПриход = ЗаказыПокупателейОстаткиИОбороты.КоличествоКонечныйОстаток
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыОтгрузки.НеОтгружен)
	               |		КОГДА ЕСТЬNULL(ЗаказыПокупателейОстаткиИОбороты.КоличествоКонечныйОстаток, 0) <= 0
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыОтгрузки.Отгружен)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыОтгрузки.ЧастичноОтгружен)
	               |	КОНЕЦ КАК СостояниеОтгрузки,
	               |	ВЫБОР
	               |		КОГДА РасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход = 0
	               |				ИЛИ РасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход ЕСТЬ NULL 
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыОплаты.НеОплачен)
	               |		КОГДА РасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход >= РасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыОплаты.Оплачен)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыОплаты.ЧастичноОплачен)
	               |	КОНЕЦ КАК СтатусОплаты
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПокупателей.ОстаткиИОбороты(, , , , ЗаказПокупателя = &ЗаказПокупателя) КАК ЗаказыПокупателейОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКонтрагентами.ОстаткиИОбороты(, , , , Сделка = &ЗаказПокупателя) КАК РасчетыСКонтрагентамиОстаткиИОбороты
	               |		ПО ЗаказыПокупателейОстаткиИОбороты.ЗаказПокупателя = РасчетыСКонтрагентамиОстаткиИОбороты.Сделка";
	Запрос.УстановитьПараметр("ЗаказПокупателя" ,ЗаказПокупателя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтатусОтгрузки = Выборка.СостояниеОтгрузки;
	КонецЕсли;
	
	Возврат СтатусОтгрузки;
	
КонецФункции

Функция ПолучитьСтатусДоставкиЗаказаПокупателя(ЗаказПокупателя) Экспорт

	СтатусДоставки = Перечисления.МегаЛогист_СтатусыДоставки.НеВыполнена;
	Если Не ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат СтатусДоставки;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ДополнительныеРеквизитыЗаказовПокупателей.Заказ КАК Заказ,
	//			   |	ВЫБОР
	//			   |		КОГДА ДополнительныеРеквизитыЗаказовПокупателей.Самовывоз = ИСТИНА
	//			   |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.Самовывоз)
	//			   |		ИНАЧЕ ВЫБОР
	//			   |				КОГДА МЗ_Выполняются.Статус > 0
	//			   |					ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.Выполняется)
	//			   |				ИНАЧЕ ВЫБОР
	//			   |						КОГДА МЗ_Выполнен.Статус > 0
	//			   |							ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.Выполнена)
	//			   |						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.НеВыполнена)
	//			   |					КОНЕЦ
	//			   |			КОНЕЦ
	//			   |	КОНЕЦ КАК СтатусДоставки
	//			   |ИЗ
	//			   |	РегистрСведений.ДополнительныеРеквизитыЗаказовПокупателей КАК ДополнительныеРеквизитыЗаказовПокупателей
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//			   |			ИсторияСтатусовМаршрутныхЗаданийСрезПоследних.МаршрутноеЗадание.ЗаказПокупателя КАК ЗаказПокупателя,
	//			   |			КОЛИЧЕСТВО(ИсторияСтатусовМаршрутныхЗаданийСрезПоследних.Статус) КАК Статус
	//			   |		ИЗ
	//			   |			РегистрСведений.ИсторияСтатусовМаршрутныхЗаданий.СрезПоследних(, Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыМаршрутныхЗаданий.Выполняется)) КАК ИсторияСтатусовМаршрутныхЗаданийСрезПоследних
	//			   |		
	//			   |		СГРУППИРОВАТЬ ПО
	//			   |			ИсторияСтатусовМаршрутныхЗаданийСрезПоследних.МаршрутноеЗадание.ЗаказПокупателя) КАК МЗ_Выполняются
	//			   |		ПО ДополнительныеРеквизитыЗаказовПокупателей.Заказ = МЗ_Выполняются.ЗаказПокупателя
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//			   |			ИсторияСтатусовМаршрутныхЗаданийСрезПоследних.МаршрутноеЗадание.ЗаказПокупателя КАК ЗаказПокупателя,
	//			   |			КОЛИЧЕСТВО(ИсторияСтатусовМаршрутныхЗаданийСрезПоследних.Статус) КАК Статус
	//			   |		ИЗ
	//			   |			РегистрСведений.ИсторияСтатусовМаршрутныхЗаданий.СрезПоследних(, Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыМаршрутныхЗаданий.Выполнен)) КАК ИсторияСтатусовМаршрутныхЗаданийСрезПоследних
	//			   |		
	//			   |		СГРУППИРОВАТЬ ПО
	//			   |			ИсторияСтатусовМаршрутныхЗаданийСрезПоследних.МаршрутноеЗадание.ЗаказПокупателя) КАК МЗ_Выполнен
	//			   |		ПО ДополнительныеРеквизитыЗаказовПокупателей.Заказ = МЗ_Выполнен.ЗаказПокупателя
	//			   |ГДЕ
	//			   |	ДополнительныеРеквизитыЗаказовПокупателей.Заказ = &ЗаказПокупателя";
	
	
	
	// Возможно, понадобиться добавить в СтатусыДоставки заказов значение "ВыполненаЧастично"
	// На случай, если одна заявка выполнена, а другая к распределению <- сейчас будет показывать "выполнена"
	// В этом случае надо будет чуть чуть изменить приоритеты в запросе
	Запрос.Текст = "ВЫБРАТЬ
	               |	МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.Заказ,
	               |	ВЫБОР
	               |		КОГДА МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.Самовывоз = ИСТИНА
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыДоставки.Самовывоз)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СтатусыПоПриоритетам.ПриоритетСтатусов = 3
	               |					ТОГДА ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыДоставки.Выполняется)
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА СтатусыПоПриоритетам.ПриоритетСтатусов = 2
	               |							ТОГДА ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыДоставки.Выполнена)
	               |						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыДоставки.НеВыполнена)
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СтатусДоставки
	               |ИЗ
	               |	РегистрСведений.МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей КАК МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ИсторияСтатусовМаршрутныхЗаданийСрезПоследних.МаршрутноеЗадание.ЗаказПокупателя КАК ЗаказПокупателя,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА ИсторияСтатусовМаршрутныхЗаданийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыМаршрутныхЗаданий.Выполняется)
	               |						ТОГДА 3
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ИсторияСтатусовМаршрутныхЗаданийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыМаршрутныхЗаданий.Выполнен)
	               |								ТОГДА 2
	               |							ИНАЧЕ 1
	               |						КОНЕЦ
	               |				КОНЕЦ) КАК ПриоритетСтатусов
	               |		ИЗ
	               |			РегистрСведений.МегаЛогист_ИсторияСтатусовМаршрутныхЗаданий.СрезПоследних(, ) КАК ИсторияСтатусовМаршрутныхЗаданийСрезПоследних
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ИсторияСтатусовМаршрутныхЗаданийСрезПоследних.МаршрутноеЗадание.ЗаказПокупателя) КАК СтатусыПоПриоритетам
	               |		ПО МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.Заказ = СтатусыПоПриоритетам.ЗаказПокупателя
	               |ГДЕ
	               |	МегаЛогист_ДополнительныеРеквизитыЗаказовПокупателей.Заказ = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя" ,ЗаказПокупателя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтатусДоставки = Выборка.СтатусДоставки;
	КонецЕсли;
	
	Возврат СтатусДоставки;
	
КонецФункции

// Функция считывает источник информации при обращении контрагента
//
// Параметры: 
//  Контрагент.
//
// Возвращаемое значение:
//  Источник.
//
Функция ПрочитатьИсточникИнформацииПриОбращении(Контрагент) Экспорт

	ИсточникИнформации=Контрагент.ИсточникИнформацииПриОбращении;	
	Возврат ИсточникИнформации;

КонецФункции
